

// প্রশ্ন:  
// একটি C প্রোগ্রাম লিখুন যা 1 থেকে 100 পর্যন্ত সংখ্যার জন্য FizzBuzz 
// গেমটি বাস্তবায়ন করবে। প্রোগ্রামটি নিম্নলিখিত নিয়ম অনুসরণ করবে:  
// - যদি সংখ্যাটি 3 এবং 5 উভয় দ্বারা বিভাজ্য হয়, তবে "FizzBuzz" প্রিন্ট করবে।  
// - যদি সংখ্যাটি শুধুমাত্র 3 দ্বারা বিভাজ্য হয়, তবে "Fizz" প্রিন্ট করবে।  
// - যদি সংখ্যাটি শুধুমাত্র 5 দ্বারা বিভাজ্য হয়, তবে "Buzz" প্রিন্ট করবে।  
// - অন্যথায়, সংখ্যাটি নিজেই প্রিন্ট করবে।  
// প্রতিটি আউটপুট আলাদা লাইনে প্রিন্ট করতে হবে।

#include<stdio.h>
int main()
{
    int i ;
    i = 1;
    for( ; i<=100 ; i++)
    {
        if(i%3==0 && i %5==0){
            printf("FizzBuzz \n");
        }
        else if(i%3==0){
            printf("Fizz \n");
        }
        else if(i%5==0){
            printf("Buzz \n");
        }
        else{
            printf("%d \n",i);
        }

    }
}
